// 1

// Document Object Model (DOM) წარმოადგენს დოკუმენტის სტრუქტურის აღწერას
// რომელიც ბრაუზერს შესაძლებლობას აძლევს,
//  HTML და XML დოკუმენტები სტრუქტურირებული ობიექტების სახით წარადგინოს


// 2


let num1 = 10;
let num2 = 15;

let sum = num1 + num2;
console.log(sum); 


// 3


// Console არის დეველოპერების ინსტრუმენტი, რომელიც საშუალებას გვაძლევს:
// დავწეროთ და გავუშვათ JavaScript კოდი.
// დავაკვირდეთ შეცდომებს.
// მოვახდინოთ მონაცემების დათვალიერება და ლოგირება.
console.log("Hello, world!");


// 4
// let არის თანამედროვე JavaScript-ს ტიპის ცვლადების განსაზღვრის ინსტრუქცია.
// ის ბლოკის მასშტაბით მოქმედებს, რაც ნიშნავს, რომ ცვლადი ხელმისაწვდომია მხოლოდ იმ ბლოკში, სადაც გამოცხადდა
// შესაძლებელია ცვლადის მნიშვნელობის შეცვლა

let age = 25; 
age = 30; 
console.log(age); 

{
    let name = "John";
    console.log(name); 
}
