# task2

# map არის ფუნქცია, რომელიც გამოიყენება სიაზე (ან სხვა იტერირებად ობიექტზე) ელემენტების დასამუშავებლად.
# ის გადის ყველა ელემენტზე და თითოეულს განსაზღვრულ ფუნქციას იყენებს
# შედეგად გვიბრუნებს ახალ სიას, რომელიც შეიცავს გარდაქმნილ ელემენტებს

# task3

# filter ფუნქცია გამოიყენება სიაში ან სხვა იტერირებად ობიექტში მხოლოდ იმ ელემენტების გამოსავლენად,
# რომლებიც აკმაყოფილებენ გარკვეულ პირობას. ის იღებს ფუნქციას,
# რომელიც აბრუნებს True ან False და ფილტრავს მხოლოდ იმ ელემენტებს, რომლებსაც True მნიშვნელობა აქვთ