// 1

let number1 = parseFloat(prompt("Enter the first number:"));
let number2 = parseFloat(prompt("Enter the second number:"));
let sum = number1 + number2;
alert(`The sum of the numbers is: ${sum}`);


// 3

// საუკეთესო პრაქტიკები:
// გამოიყენეთ სემანტიკური HTML და სუფთა კოდი.
// addEventListener გამოყენებით მოუსმინეთ ივენთებს.
// დაამატეთ ვალიდაცია კლიენტის და სერვერის მხარეს.
// არასდროს ჩაწეროთ მგრძნობიარე ინფორმაცია ლოგებში.
// დაწერეთ მოდულური და ხელახლა გამოსაყენებელი კოდი.


// 4

// არის ვებ-სტანდარტის ნაწილი და სერვერზე მარტივად მუშავდება.
// იძლევა form.elements name API-ს გამოყენების საშუალებას.
// თავიდან იცილებს id-ის კონფლიქტებს მრავალ ფორმაში.
// უზრუნველყოფს უკეთეს თავსებადობას სხვადასხვა ბრაუზერსა და ტექნოლოგიასთან